child("Анна", "Дмитрий").
child("Анна", "Светлана").
child("Максим", "Дмитрий").
child("Максим", "Светлана").
child("Валерий", "Николай").
child("Валерий", "Татьяна").
child("Дмитрий", "Николай").
child("Дмитрий", "Татьяна").
child("Владимир", "Виктор").
child("Владимир", "Антонина").
child("Светлана", "Виктор").
child("Светлана", "Антонина").
child("Виктор", "/Мытарёв/").
child("Виктор", "//").
child("Клавдия", "/Мытарёв/").
child("Клавдия", "//").
child("Мария", "/Мытарёв/").
child("Мария", "//").
child("Валентина", "/Мытарёв/").
child("Валентина", "//").
child("Антонина", "//").
child("Людмила", "//").
child("Тамара", "//").
child("Валентина", "//").
child("Нина", "//").
child("Владимир", "//").
child("Мария", "Валерий").
child("Мария", "//").
child("Валерий", "Валерий").
child("Валерий", "//").
child("Антон", "Владимир").
child("Антон", "//").
child("Татьяна", "Алексей").
child("Татьяна", "Зоя").
child("Виктор", "Алексей").
child("Виктор", "Зоя").
child("Николай", "Борис").
child("Николай", "Татьяна").
child("Юрий", "Борис").
child("Юрий", "Татьяна").

female("Светлана").
female("Анна").
female("Татьяна").
female("Антонина").
female("Клавдия").
female("Мария").
female("Валентина").
female("Людмила").
female("Тамара").
female("Валентина").
female("Нина").
female("Мария").
female("Зоя").
female("Татьяна").

male("Дмитрий").
male("Максим").
male("Николай").
male("Виктор").
male("Владимир").
male("/Мытарёв/").
male("Владимир").
male("Валерий").
male("Валерий").
male("Антон").
male("Алексей").
male("Виктор").
male("Борис").
male("Юрий").

brother_in_law(Pers, Bro) :-
	male(Pers),
	child(Ch, Pers),
	child(Ch, Wife),
	female(Wife),
	child(Wife, Grand),
	child(Bro, Grand),
	male(Bro).

solve(X, B) :- brother_in_law(X, B).
